In [1]:
import pandas as pd

In [2]:
var = pd.DataFrame({"name":['a','b','c','a','c','b','a','a','b'],"s1":[12,12,13,14,15,12,13,14,12],"s2":[1,2,1,2,1,1,2,3,3]})

In [6]:
var_new = var.groupby('name')  # it groups all the values according to the name paramter

In [7]:
var_new

In [8]:
for x,y in var_new:
    print(x)
    print(y)

a
  name  s1  s2
0    a  12   1
3    a  14   2
6    a  13   2
7    a  14   3
b
  name  s1  s2
1    b  12   2
5    b  12   1
8    b  12   3
c
  name  s1  s2
2    c  13   1
4    c  15   1

In [9]:
# to get sigle data

In [11]:
var_new.get_group("a")  # gives all the group values

  name  s1  s2
0    a  12   1
3    a  14   2
6    a  13   2
7    a  14   3

In [12]:
var_new.min()

      s1  s2
name
a     12   1
b     12   1
c     13   1

In [13]:
var_new.max()

      s1  s2
name
a     14   3
b     12   3
c     15   1

In [14]:
var_new.mean()

         s1   s2
name
a     13.25  2.0
b     12.00  2.0
c     14.00  1.0